{
    "proyectos": 
    [{
        "id":1,
        "imagen": "https://live.staticflickr.com/65535/52936046068_b18b5f6e38_c.jpg",
        "imagenes":[
        "https://live.staticflickr.com/65535/52936046068_b18b5f6e38_c.jpg",
        "https://live.staticflickr.com/65535/52957926608_d21e0ec426_z.jpg",
        "https://live.staticflickr.com/65535/52956873717_7b59e65e3e_c.jpg",
        "https://live.staticflickr.com/65535/52957617219_831348c5fd_c.jpg",
        "https://live.staticflickr.com/65535/52957926633_903ae81443_c.jpg"],
        "titulo": "Xcommerce",
        "tecnologias": ["SQL", "C#", ".NET", "Windows-Forms","Entity-Framework"],
        "resumen": "Proyecto enfocado para administracion de Bar y Venta de productos.",
        "descripcion": "Proyecto enfocado en la administración de un sistema para un Bar con Kiosco. Se partió de la metodología Model-First y se diseñó la base de datos teniendo en cuenta las entidades implicadas en el servicio brindado por un bar (Usuarios,Mozos, Mesas, Productos,etc). Se trata un proyecto grupal realizado para la materia Laboratorio 2 en la Tecnicatura Universitaria en Programación UTN-FRT.",
        "servicios": ["Gestión ABM de Productos.",
        "Gestión de Roles con diversos permisos administrativos.",
        "Gestión ABM de Empleados.",
        "Gestión ABM de Clientes.",
        "Apertura, movimientos, cierre y balance de la Caja.",
        "Apertura, cierre y cobro total de las Mesas.",
        "Asignación de Mozos al servicio de cada mesa.",
        "Registro de stock y venta de Productos."],
        "repositorio":"https://github.com/JISayago/Xcommerce"
        
    },
    {
        "id":2,
        "imagen": "https://live.staticflickr.com/65535/52936046063_d6828735f7_h.jpg",
        "imagenes":["https://live.staticflickr.com/65535/52936046063_d6828735f7_h.jpg",
        "https://live.staticflickr.com/65535/52959697996_3fd1b16d44_b.jpg",
        "https://live.staticflickr.com/65535/52960154938_e2fc62f9b2_h.jpg",
        "https://live.staticflickr.com/65535/52959099362_3b6e18b877_h.jpg",
        "https://live.staticflickr.com/65535/52960154933_5f76e7df88_h.jpg",
        "https://live.staticflickr.com/65535/52936046063_d6828735f7_h.jpg"],
        "titulo": "Agenda Natura",
        "tecnologias": ["Php","Laravel","Mysql","Html","JavaScript","Css", "Bootstrap"],
        "resumen": "Se trata de un proyecto desarrollado para una vendedora por catálogo de productos Natura.",
        "descripcion": "Proyecto enfocado en digitalizar la metodología de trabajo de una vendedora de productos Natura. Se tomó de referencia los métodos de registros que realizaba previamente y se los replicó en formato digital. Al comprender la totalidad de los servicios que brindaba, se le ofreció agregar funcionalidades que no estaban contempladas en un primer momento, como por ejemplo, la posibilidad de convertir un texto de whatsapp en un alta de pedido dentro del sistema. Este proyecto se usó de proyecto final para la Tecnicatura Univercitaria en Programación en la facultad UTN-FRT.",
        "servicios":["Formulario de Registro y Login.",
        "Gestión ABM de Productos.",
         "Gestión ABM de Clientes.",
         "Gestión ABM de Pedidos.",
         "Gestión ABM de Ciclos.",
         "Se muestra el estado de cliente. Se controlan pedidos, estado de deuda, y ventas.",
         "Control de pedidos de los clientes.",
         "Posibilidad de vender productos de manera normal, sin depender necesariamente de haber realizado un pedido previamente.",
         "Control de stock de productos. Detallando en colores en el caso de que haya o no stock en el momento. Pudiendo filtrar por productos con y sin Stock.",
         "Balance de un periodo de tiempo que puede elgirse seleccionando una fecha de incio y una fecha de fin.",
         "Carrito funcional para la venta de productos, con control de stock y balance.",
         "Se muestran distintos detalles con íconos de diversos colores para indicar, por ejemplo en el caso de los clientes se detalla realizó un pedido o si debe dinero.",
         "Conversión de texto extraído de Whatsapp en registro automático del pedido y sus productos."],
        "repositorio":"https://github.com/JISayago/FinalTUP-UTN2021"
   },
   {
   "id":3,
        "imagen": "https://live.staticflickr.com/65535/52940478064_e7f1438b6a_h.jpg",
        "imagenes":["https://live.staticflickr.com/65535/52956910257_a77122d147_h.jpg",
        "https://live.staticflickr.com/65535/52957974318_050d8d301f_h.jpg",
        "https://live.staticflickr.com/65535/52957507266_fb3c3dfcab_h.jpg",
        "https://live.staticflickr.com/65535/52957507261_954c459e92_h.jpg",
        "https://live.staticflickr.com/65535/52957964898_2fdcbe069a_h.jpg"],
        "titulo": "Venta Comics",
        "tecnologias": ["React","JavaScript","Css","Html"],
        "resumen": "Proyecto desarrollado a partir de la API gratuita bridada por Marvel.",
        "descripcion": "Proyecto realizado para la práctica de la librería de React y el consumo de la Api pública de Marvel. Fué planteada como una web de ventas de comics y se utilizó, principalmente, para el aprendizaje de algunas funciones provistas por react: useState, useEffect y useContext. No cuenta con navegación, ya que es un apartado para agregar a futuro y cuenta con login y registro visuales pero no funcionales, ya que se trata de un proyecto enteramente front-end. Los estilos y transiciones fueron hechos con Css puro.",
        "servicios":["Muestra el listado de comics, con la posibilidad de abrir un modal mostrando los detalles de cada uno y pudiéndolo agregar al carrito para su compra.",
         "Posee un buscador funcional, que se encarga de filtrar inmediatamente el listado de comics por título.",
         "Tambiém posse un carrito que muestra los productos con su respectivo precio. También muestra el total del gasto y premite la eliminación de los comics no deseados.",
         "Permite la visualizacion de un login y registro pero no funcionales."],
        "repositorio":"https://github.com/JISayago/Api-Comics-Marvel"
   },
   {
    "id":4,
        "imagen": "https://live.staticflickr.com/65535/52940932448_5ff87b998d_z.jpg",
        "imagenes":["https://live.staticflickr.com/65535/52942431962_a34dc3ab13_z.jpg",
        "https://live.staticflickr.com/65535/52942431977_068d3d32b5_z.jpg",
        "https://live.staticflickr.com/65535/52943492723_51c6c7fe67_z.jpg",
        "https://live.staticflickr.com/65535/52943492743_a242e5a73f_z.jpg"],
        "titulo": "Juego de reflejos",
        "tecnologias": ["Arduino"],
        "resumen": "Se trata de un juego de reflejos, que cuenta con sensores conectados a una placa de arduino.",
        "descripcion": "Se trata de un juego que busca medir el mejor tiempo de reacción entre el parpadeo de una luz led y la velocidad en que acercas la mano a un sensor de proximidad. Esta formado por una placa arduino uno, 3 led, 3 sensores de ultrasonido Hc-sr04 de distancia, 1 perilla (potenciómetro), 1 display 16x2,2 botones. Se trata de un proyecto realizado para la materia Laboratorio 3 (Robótica) en la Tecnicatura Universitaria en Programación UTN-FRT.",
        "servicios":["Calcula la diferencia de tiempo desde que se enciende un led hasta que se acerca la mano a una cierta distancia del lector de ultrasonido.",
        "El juego cuenta con un menú que permite elegir entre tres niveles posibles, y un sub-menú para elegir los tiempos entre el encendido de un led y el encendido de otro.",
        "El resultado del mejor tiempo de reaccion sera desplegado en un display, en el cual tambien va llevando la cuenta de aciertos/errores."],
        "repositorio":"https://github.com/JISayago/Arduino-Juego-Reflejos"
   },
   {
   "id":5,
        "imagen": "https://live.staticflickr.com/65535/52941085979_fc87c47756_h.jpg",
        "imagenes":["https://live.staticflickr.com/65535/52942431962_a34dc3ab13_z.jpg",
        "https://live.staticflickr.com/65535/52942431992_60f90ddf7c_z.jpg",
        "https://live.staticflickr.com/65535/52943492743_a242e5a73f_z.jpg"],
        "titulo": "Portfolio-Personal",
        "tecnologias": ["React","Html","JavaScript","TailwindCss"],
        "resumen": "Página actual, portfolio personal.",
        "descripcion": "Portfolio personal. Pagina desarrollada en React en la que se utilizó TailwindCss para los estilos. Fue creada para alojar mis proyectos personales y facilitar un medio de contacto con gente interesada en mis servicios. Además cuenta con la posibilidad de mandar un mail a través del formulario y se utilzia la API de Whatsapp que permite mandar mensaje directamente a mi número de contacto. Se utilizaron diversos paquetes node en los que se encuentran: React-router-dom, react-icons, EmailJs, SweetAlert, React-Icons, entre otros.",
        "servicios":["Se muestran los proyectos con sus descripciones y respectivos links de GitHub.",
        "Redirecciona url dentro de la misma página gracias a la utilización de React-Router-Dom.",
        "Permite el envío de correo electrónico y contacto vía Whatsapp.",
        "Redirecciona a una página 404 si la página no existe."],
        "repositorio":"https://github.com/JISayago/portfolio"
   }
   
]
}